common-lisp-and-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-07 Tue 08:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Common Lisp and Emacs</title>
<meta name="author" content="shubhamkar" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, shrink-to-fit=no">
<link rel="stylesheet" type="text/css" href="others.css">
<link rel="stylesheet" type="text/css" href="common.css">

<link rel='stylesheet' href='styles.css'>
<link rel='stylesheet' type='text/css' href='https://fonts.googleapis.com/css?family=Droid+Sans' />
</head>
<body>
<div id="content" class="content">
<nav>
<p>
<a href="index.html">Home</a> | <a href="ai-cogsci.html">AI and CogSci</a> | <b>COMMON LISP AND EMACS</b> | <a href="miscellaneous.html">Miscellaneous</a>
</p>
</nav>

<br>

<div id="outline-container-org23adf8b" class="outline-2">
<h2 id="org23adf8b">On This Page</h2>
<div class="outline-text-2" id="text-org23adf8b">
<ul class="org-ul">
<li><a href="#major-common-lisp-related-projects">Major Common Lisp-related Projects</a>
<ul class="org-ul">
<li><a href="#1-python-libraries-for-common-lisp">1. Python libraries for Common Lisp</a></li>
<li><a href="#2-fast-math-library-for-common-lisp">2. Fast math library for Common Lisp</a></li>
<li><a href="#3-peltadot-peltadot-extends-lisps-types-and-dispatches-over-them">3. PELTADOT: PELTADOT Extends Lisp's Types And Dispatches Over Them</a></li>
</ul></li>
<li><a href="#conda-lisp">Conda Lisp</a></li>
</ul>
</div>
</div>


<div id="outline-container-major-common-lisp-related-projects" class="outline-2">
<h2 id="major-common-lisp-related-projects">Major Common Lisp-related Projects</h2>
<div class="outline-text-2" id="text-major-common-lisp-related-projects">
<p>
My major Lisp projects can be divided into three broad themes.
</p>
</div>

<div id="outline-container-1-python-libraries-for-common-lisp" class="outline-3">
<h3 id="1-python-libraries-for-common-lisp">1. Python libraries for Common Lisp</h3>
<div class="outline-text-3" id="text-1-python-libraries-for-common-lisp">
<p>
<a href="https://www.quora.com/What-is-your-favourite-non-mainstream-programming-language/answer/Shubhamkar-Ayare?ch=10&amp;share=3d935d6a&amp;srid=tWo7">Common Lisp is a superb tool.</a> Unfortunately, its ecosystem vastly lags behind mainstream languages like Python. As one of my past-times, I have been working to provide facilities for calling Python functions and callables from Lisp. There are two major approaches to this:
</p>

<ul class="org-ul">
<li><a href="https://github.com/digikar99/py4cl2">Through interprocess communication</a> (builds upon <a href="https://github.com/bendudson/py4cl">bendudson/py4cl</a>)</li>
<li><a href="https://github.com/digikar99/py4cl2-cffi">By embedding python using its C-API</a></li>
</ul>

<p>
The former is robust but slow. The latter is fast but relatively brittle. I'm certainly not the first one to attempt this. You can find more about the latter approach - as well as the open issues - from <a href="https://doi.org/10.5281/zenodo.10997435">this paper</a>.
</p>
</div>
</div>

<div id="outline-container-2-fast-math-library-for-common-lisp" class="outline-3">
<h3 id="2-fast-math-library-for-common-lisp">2. Fast math library for Common Lisp</h3>
<div class="outline-text-3" id="text-2-fast-math-library-for-common-lisp">
<p>
Common Lisp actually has <a href="https://gist.github.com/digikar99/16066dbf24b8789c969ea58837e0fbef">several numerical computing libraries</a>. While many of them use BLAS/LAPACK/GSLL for linear algebra operations, there are no optimized operations in these libraries for basic mathematics. By basic mathematics, I mean addition, subtraction, multiplication, division. But even beyond them, there are other operations including floor, ceiling, round, absolute-value, exponentiation, logarithmic, as well as trigonometric, inverse trigonometric and their hyperbolic counterparts.
</p>

<p>
Moreover, most libraries (including in non Common Lisp ecosystems) fall short of <a href="https://gist.github.com/digikar99/ba2f0bb34021bfdc086b9c1c712ca228">my wishlist</a>. Thus, I have been developing <a href="https://digikar99.github.io/numericals/">numericals and dense-numericals</a> to fulfil this itch. I widely adopt:
</p>

<ul class="org-ul">
<li><a href="https://github.com/digikar99/bmas">BMAS</a> backed by <a href="https://sleef.org/">SLEEF</a>, which uses SIMD operations to speed things up</li>
<li>and more recently, <a href="https://eigen.tuxfamily.org/">Eigen</a> backed by <a href="https://www.netlib.org/blas/">BLAS</a> and <a href="https://www.netlib.org/lapack/">LAPACK</a></li>
</ul>

<p>
This is further coupled with multithreading using <a href="https://lparallel.org/">lparallel</a> and the C-library builtin <a href="https://www.openmp.org/">OpenMP</a>.
</p>

<p>
numericals works with standard Common Lisp arrays, this means, you can use it in conjunction with any other Lisp array computing library that also works with Lisp arrays. You can read more about numericals and dense-numericals <a href="https://digikar99.github.io/numericals/">here</a>.
</p>

<p>
This line of work has actually spanned two C libraries. So, if you are a C developer and are looking for projects to contribute, here are two such projects.
</p>

<ul class="org-ul">
<li><a href="https://github.com/digikar99/bmas">BMAS</a>: The ultimate goal is to provide a certain set of math operations across different SIMD platforms and for strided vectors. Currently, full support is only limited to AVX256.</li>
<li><a href="https://github.com/digikar99/ceigen_lite">ceigen<sub>lite</sub></a>: <a href="https://eigen.tuxfamily.org/">Eigen</a> is an excellent C++ library for numerical computing with vectors and matrices. ceigen<sub>lite</sub> aims to provide a C interface to some of the common tasks that Eigen is capable of. In some sense, this will be a higher level interface to BLAS and LAPACK. Currently, this is just 20% complete. Besides, the compile times are enormous, so distributing the library as a binary would be great! But this has only so far been done for linux-amd64. Porting to other OS and architectures remains.</li>
</ul>
</div>
</div>

<div id="outline-container-3-peltadot-peltadot-extends-lisps-types-and-dispatches-over-them" class="outline-3">
<h3 id="3-peltadot-peltadot-extends-lisps-types-and-dispatches-over-them">3. PELTADOT: PELTADOT Extends Lisp's Types And Dispatches Over Them</h3>
<div class="outline-text-3" id="text-3-peltadot-peltadot-extends-lisps-types-and-dispatches-over-them">
<p>
Despite being a great language, I have run into several issues while using Common Lisp to develop the numerical computing library described above:
</p>

<ol class="org-ol">
<li><b>CLOS methods dispatch over common lisp classes but not types.</b> There does not seem to be any trivial way to adapt MOP to dispatch on types instead of classes. Thus, there is no way for ANSI common lisp to dispatch over specialized array types.</li>
<li><b>ANSI common lisp does not allow defining user-defined compound types</b> similar to the builtin <code>(vector &amp;optional element-type)</code> or <code>(integer &amp;optional lower-limit higher-limit)</code>. Types defined using <a href="http://clhs.lisp.se/Body/m_deftp.htm">CL:DEFTYPE</a> are what CLHS calls <a href="http://clhs.lisp.se/Body/26_glo_d.htm#derived_type">derived type</a> specifiers, that is, mere abbreviations and simple combinations of existing types.</li>
<li>CLOS-based multiple dispatch might not be the best way to implement adhoc polymorphism compared to <b>traits</b>.</li>
<li><code>cl:coerce</code> is non-extensible.</li>
</ol>

<p>
These issues were previously addressed using <a href="https://github.com/digikar99/polymorphic-functions">polymorphic-functions</a>, <a href="https://github.com/digikar99/extensible-compound-types">extensible-compound-types</a>, <a href="https://github.com/digikar99/extensible-optimizing-coerce">extensible-optimizing-coerce</a>, coupled with a number of add-ons and supporting libraries. Over time, these projects became more closely related than what was originally envisioned. Thus, PELTADOT is an attempt to bring all of them together to make maintenance, version control and dependency management easier. See <a href="https://gitlab.com/digikar/peltadot/">here</a> for more information.
</p>
</div>
</div>
</div>

<div id="outline-container-conda-lisp" class="outline-2">
<h2 id="conda-lisp">Conda Lisp</h2>
<div class="outline-text-2" id="text-conda-lisp">
<p>
Lately, I'm facing a growing need for a conda-forge like channel for Common Lisp libraries. Hopefully, this will be much simpler and easier to maintain than conda-forge. But, it still needs to be set up. Ping me if you can relate to this need.
</p>

<p>
The Conda Lisp channel will not only provide lisp libraries, but also lisp implementations. In addition, it will be possible for implementations and libraries to depend on non-lisp dependencies that are already a part of conda-forge. Version control and conflict resolution should also be handled well.
</p>

<p>
If you think anaconda is slow, you are not alone: developers have gotten together to create <a href="https://mamba.readthedocs.io/en/latest/installation/micromamba-installation.html">micromamba</a>. If you think conda-build is slow, again, you are not alone; you should check out <a href="https://github.com/prefix-dev/rattler-build/">rattler-build</a>.
</p>
</div>
</div>
</div>
</body>
</html>
